#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rdcresume/resume-backend/runs/run-EtokkRPkWCVtgXqj

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=destined-chipmunk]
data.archive_file.zip_python_code: Refreshing...
data.archive_file.zip_python_code: Refresh complete after 0s [id=a8293125d4dc8d08250d56061e5a166be7bc6786]
aws_iam_policy.BasicLambdaPolicy: Refreshing state... [id=arn:aws:iam::721647388262:policy/BasicLambdaPolicy]
aws_iam_policy.VisitCountTotalAccess: Refreshing state... [id=arn:aws:iam::721647388262:policy/VisitorCountTotalAccess]
aws_iam_role.lambda_role: Refreshing state... [id=terraform_aws_lambda_role]
aws_dynamodb_table.basic-dynamodb-table: Refreshing state... [id=VisitCountTotal]
aws_dynamodb_table_item.VisitCountTotal: Refreshing state... [id=VisitCountTotal|visitor_id||visitor_counter|]
aws_iam_policy.BasicLambdaPolicy: Drift detected (update)
aws_iam_policy.VisitCountTotalAccess: Drift detected (update)
aws_iam_role.lambda_role: Drift detected (update)
aws_dynamodb_table.basic-dynamodb-table: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.attachment["arn:aws:iam::721647388262:policy/BasicLambdaPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::721647388262:policy/BasicLambdaPolicy"
      + role       = "terraform_aws_lambda_role"
    }

  # aws_iam_role_policy_attachment.attachment["arn:aws:iam::721647388262:policy/VisitorCountTotalAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::721647388262:policy/VisitorCountTotalAccess"
      + role       = "terraform_aws_lambda_role"
    }

  # aws_lambda_function.visitorFunc will be created
  + resource "aws_lambda_function" "visitorFunc" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./lambda/visitorFunc.zip"
      + function_name                  = "visitorFunc"
      + handler                        = "visitorFunc.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::721647388262:role/terraform_aws_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @RyanChris95, Action: `pull_request`*